app/Controllers/AchatController.php

SELECT *
FROM `produit`
---
    public function index()
    {
        // Vérifier qu'une caisse est bien choisie en session
        if (!session('caisse')) {
            return redirect()->to('/')->with('error', 'Veuillez choisir une caisse d\'abord.');
        }

        $produitModel = new ProduitModel();
        $achatModel   = new AchatModel();

        $caisseId = session('caisse')['id'];

        // Récupérer ou créer l'achat en cours (et mettre à jour la session)
        $achat = $achatModel->getAchatEnCours($caisseId);
        session()->set('achat_id', $achat['id']);

        // Récupérer les lignes de l'achat en cours avec jointure sur produit
        $lignes = $achatModel->getLignes($achat['id']);

        return view('achat/index', [
            'produits' => $produitModel->findAll(),
            'lignes'   => $lignes,
        ]);

SELECT *
FROM `produit`
WHERE `produit`.`id` = '6'
---
    public function ajouterLigne()
    {
        if (!session('caisse')) {
            return redirect()->to('/')->with('error', 'Veuillez choisir une caisse d\'abord.');
        }

        $produitId = $this->request->getPost('produit_id');
        $quantite  = (int) $this->request->getPost('quantite');

        if (!$produitId || $quantite < 1) {
            return redirect()->back()->with('error', 'Produit ou quantité invalide.');
        }

        $produitModel = new ProduitModel();
        $achatModel   = new AchatModel();

        $produit  = $produitModel->find($produitId);

UPDATE `produit` SET `quantite_stock` = 30
WHERE `produit`.`id` IN ('6')
---
        );

        // Décrémenter le stock du produit
        $produitModel->update($produitId, [
            'quantite_stock' => $produit['quantite_stock'] - $quantite,
        ]);