app/Controllers/ProduitController.php

SELECT *
FROM `produit`
---
    public function index()
    {
        $produitModel = new ProduitModel();
        return view('produit/index', [
            'produits' => $produitModel->findAll(),
        ]);