app/Models/AchatModel.php

SELECT *
FROM `achat`
WHERE `caisse_id` = 1
AND `statut` = 'en_cours'
 LIMIT 1
INSERT INTO `achat` (`caisse_id`, `statut`) VALUES (1, 'en_cours')
SELECT *
FROM `achat`
WHERE `achat`.`id` = 1
---
    public function getAchatEnCours($caisseId)
    {
        $achat = $this->where('caisse_id', $caisseId)
                      ->where('statut', 'en_cours')
                      ->first();

        if (!$achat) {
            $id = $this->insert([
                'caisse_id' => $caisseId,
                'statut'    => 'en_cours',
            ]);
            $achat = $this->find($id);

SELECT `p`.`designation`, `al`.`prix_unitaire`, `al`.`quantite`, `al`.`montant`
FROM `achat_ligne` `al`
JOIN `produit` `p` ON `p`.`id` = `al`.`produit_id`
WHERE `al`.`achat_id` = 1
---
    public function getLignes($achatId)
    {
        return $this->db->table('achat_ligne al')
            ->select('p.designation, al.prix_unitaire, al.quantite, al.montant')
            ->join('produit p', 'p.id = al.produit_id')
            ->where('al.achat_id', $achatId)
            ->get()
            ->getResultArray();

INSERT INTO `achat_ligne` (`achat_id`, `produit_id`, `quantite`, `prix_unitaire`, `montant`) VALUES (4, 6, 20, 1000, 20000)
---
    public function ajouterLigne($achatId, $produitId, $quantite, $prixUnitaire)
    {
        return $this->db->table('achat_ligne')->insert([
            'achat_id'      => $achatId,
            'produit_id'    => $produitId,
            'quantite'      => $quantite,
            'prix_unitaire' => $prixUnitaire,
            'montant'       => $quantite * $prixUnitaire,
        ]);

UPDATE `achat` SET `statut` = 'cloture'
WHERE `id` = 2
---
    public function cloturerAchat($achatId)
    {
        return $this->db->table('achat')
            ->where('id', $achatId)
            ->update(['statut' => 'cloture']);