app/Models/CaisseModel.php

    public function getAllCaisses()
    {
        return $this->findAll();
---
SELECT *
FROM `caisse`

    public function getCaisseById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '3'