app/Models/UtilisateurModel.php

    public function verifier(string $login, string $password): array|false
    {
        $user = $this->where('login', $login)->first();
---
SELECT *
FROM `utilisateur`
WHERE `login` = 'admin'
 LIMIT 1